carloscn/s32k344_rtd/BaseNXP_TS_T40D34M30I0R0/header/S32M27x_GDU_AE.h
#define GDU_AE_HSSRON_HSTONT_P1_MASK             (0x7F0000U)
#define GDU_AE_HSSRON_HSTONT_P1_SHIFT            (16U)
#define GDU_AE_HSSRON_HSTONT_P1_WIDTH            (7U)
#define GDU_AE_HSSRON_HSTONT_P1(x)               (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSRON_HSTONT_P1_SHIFT)) & GDU_AE_HSSRON_HSTONT_P1_MASK)

#define GDU_AE_HSSRON_HSTONT_P2_MASK             (0x7F000000U)
#define GDU_AE_HSSRON_HSTONT_P2_SHIFT            (24U)
#define GDU_AE_HSSRON_HSTONT_P2_WIDTH            (7U)
#define GDU_AE_HSSRON_HSTONT_P2(x)               (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSRON_HSTONT_P2_SHIFT)) & GDU_AE_HSSRON_HSTONT_P2_MASK)
/*! @} */

/*! @name HSSROFF - High-Side Slew Rate Off */
/*! @{ */

#define GDU_AE_HSSROFF_HSTOFFC_P1_MASK           (0x1FU)
#define GDU_AE_HSSROFF_HSTOFFC_P1_SHIFT          (0U)
#define GDU_AE_HSSROFF_HSTOFFC_P1_WIDTH          (5U)
#define GDU_AE_HSSROFF_HSTOFFC_P1(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSROFF_HSTOFFC_P1_SHIFT)) & GDU_AE_HSSROFF_HSTOFFC_P1_MASK)

#define GDU_AE_HSSROFF_HSTOFFC_P2_MASK           (0x3E0U)
#define GDU_AE_HSSROFF_HSTOFFC_P2_SHIFT          (5U)
#define GDU_AE_HSSROFF_HSTOFFC_P2_WIDTH          (5U)
#define GDU_AE_HSSROFF_HSTOFFC_P2(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSROFF_HSTOFFC_P2_SHIFT)) & GDU_AE_HSSROFF_HSTOFFC_P2_MASK)

#define GDU_AE_HSSROFF_HSTOFFC_P3_MASK           (0x7C00U)
#define GDU_AE_HSSROFF_HSTOFFC_P3_SHIFT          (10U)
#define GDU_AE_HSSROFF_HSTOFFC_P3_WIDTH          (5U)
#define GDU_AE_HSSROFF_HSTOFFC_P3(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSROFF_HSTOFFC_P3_SHIFT)) & GDU_AE_HSSROFF_HSTOFFC_P3_MASK)

#define GDU_AE_HSSROFF_HSTOFFT_P1_MASK           (0x7F0000U)
#define GDU_AE_HSSROFF_HSTOFFT_P1_SHIFT          (16U)
#define GDU_AE_HSSROFF_HSTOFFT_P1_WIDTH          (7U)
#define GDU_AE_HSSROFF_HSTOFFT_P1(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSROFF_HSTOFFT_P1_SHIFT)) & GDU_AE_HSSROFF_HSTOFFT_P1_MASK)

#define GDU_AE_HSSROFF_HSTOFFT_P2_MASK           (0x7F000000U)
#define GDU_AE_HSSROFF_HSTOFFT_P2_SHIFT          (24U)
#define GDU_AE_HSSROFF_HSTOFFT_P2_WIDTH          (7U)
#define GDU_AE_HSSROFF_HSTOFFT_P2(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSROFF_HSTOFFT_P2_SHIFT)) & GDU_AE_HSSROFF_HSTOFFT_P2_MASK)
/*! @} */

/*! @name LSSRON - Low-Side Slew Rate On */
/*! @{ */

#define GDU_AE_LSSRON_LSTONC_P1_MASK             (0x1FU)
#define GDU_AE_LSSRON_LSTONC_P1_SHIFT            (0U)
#define GDU_AE_LSSRON_LSTONC_P1_WIDTH            (5U)
#define GDU_AE_LSSRON_LSTONC_P1(x)               (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSRON_LSTONC_P1_SHIFT)) & GDU_AE_LSSRON_LSTONC_P1_MASK)

#define GDU_AE_LSSRON_LSTONC_P2_MASK             (0x3E0U)
#define GDU_AE_LSSRON_LSTONC_P2_SHIFT            (5U)
#define GDU_AE_LSSRON_LSTONC_P2_WIDTH            (5U)
#define GDU_AE_LSSRON_LSTONC_P2(x)               (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSRON_LSTONC_P2_SHIFT)) & GDU_AE_LSSRON_LSTONC_P2_MASK)

#define GDU_AE_LSSRON_LSTONC_P3_MASK             (0x7C00U)
#define GDU_AE_LSSRON_LSTONC_P3_SHIFT            (10U)
#define GDU_AE_LSSRON_LSTONC_P3_WIDTH            (5U)
#define GDU_AE_LSSRON_LSTONC_P3(x)               (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSRON_LSTONC_P3_SHIFT)) & GDU_AE_LSSRON_LSTONC_P3_MASK)

#define GDU_AE_LSSRON_LSTONT_P1_MASK             (0x7F0000U)
#define GDU_AE_LSSRON_LSTONT_P1_SHIFT            (16U)
#define GDU_AE_LSSRON_LSTONT_P1_WIDTH            (7U)
#define GDU_AE_LSSRON_LSTONT_P1(x)               (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSRON_LSTONT_P1_SHIFT)) & GDU_AE_LSSRON_LSTONT_P1_MASK)

#define GDU_AE_LSSRON_LSTONT_P2_MASK             (0x7F000000U)
#define GDU_AE_LSSRON_LSTONT_P2_SHIFT            (24U)
#define GDU_AE_LSSRON_LSTONT_P2_WIDTH            (7U)
#define GDU_AE_LSSRON_LSTONT_P2(x)               (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSRON_LSTONT_P2_SHIFT)) & GDU_AE_LSSRON_LSTONT_P2_MASK)
/*! @} */

/*! @name LSSROFF - Low-Side Slew Rate Off */
/*! @{ */

#define GDU_AE_LSSROFF_LSTOFFC_P1_MASK           (0x1FU)
#define GDU_AE_LSSROFF_LSTOFFC_P1_SHIFT          (0U)
#define GDU_AE_LSSROFF_LSTOFFC_P1_WIDTH          (5U)
#define GDU_AE_LSSROFF_LSTOFFC_P1(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSROFF_LSTOFFC_P1_SHIFT)) & GDU_AE_LSSROFF_LSTOFFC_P1_MASK)

#define GDU_AE_LSSROFF_LSTOFFC_P2_MASK           (0x3E0U)
#define GDU_AE_LSSROFF_LSTOFFC_P2_SHIFT          (5U)
#define GDU_AE_LSSROFF_LSTOFFC_P2_WIDTH          (5U)
#define GDU_AE_LSSROFF_LSTOFFC_P2(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSROFF_LSTOFFC_P2_SHIFT)) & GDU_AE_LSSROFF_LSTOFFC_P2_MASK)

#define GDU_AE_LSSROFF_LSTOFFC_P3_MASK           (0x7C00U)
#define GDU_AE_LSSROFF_LSTOFFC_P3_SHIFT          (10U)
#define GDU_AE_LSSROFF_LSTOFFC_P3_WIDTH          (5U)
#define GDU_AE_LSSROFF_LSTOFFC_P3(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSROFF_LSTOFFC_P3_SHIFT)) & GDU_AE_LSSROFF_LSTOFFC_P3_MASK)

#define GDU_AE_LSSROFF_LSTOFFT_P1_MASK           (0x7F0000U)
#define GDU_AE_LSSROFF_LSTOFFT_P1_SHIFT          (16U)
#define GDU_AE_LSSROFF_LSTOFFT_P1_WIDTH          (7U)
#define GDU_AE_LSSROFF_LSTOFFT_P1(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSROFF_LSTOFFT_P1_SHIFT)) & GDU_AE_LSSROFF_LSTOFFT_P1_MASK)

#define GDU_AE_LSSROFF_LSTOFFT_P2_MASK           (0x7F000000U)
#define GDU_AE_LSSROFF_LSTOFFT_P2_SHIFT          (24U)
#define GDU_AE_LSSROFF_LSTOFFT_P2_WIDTH          (7U)
#define GDU_AE_LSSROFF_LSTOFFT_P2(x)             (((uint32_t)(((uint32_t)(x)) << GDU_AE_LSSROFF_LSTOFFT_P2_SHIFT)) & GDU_AE_LSSROFF_LSTOFFT_P2_MASK)
/*! @} */

/*! @name OFFSDCFG - Off-State Diagnostic */
/*! @{ */

#define GDU_AE_OFFSDCFG_OSDPD0_MASK              (0x1U)
#define GDU_AE_OFFSDCFG_OSDPD0_SHIFT             (0U)
#define GDU_AE_OFFSDCFG_OSDPD0_WIDTH             (1U)
#define GDU_AE_OFFSDCFG_OSDPD0(x)                (((uint8_t)(((uint8_t)(x)) << GDU_AE_OFFSDCFG_OSDPD0_SHIFT)) & GDU_AE_OFFSDCFG_OSDPD0_MASK)

#define GDU_AE_OFFSDCFG_OSDPD1_MASK              (0x2U)
#define GDU_AE_OFFSDCFG_OSDPD1_SHIFT             (1U)
#define GDU_AE_OFFSDCFG_OSDPD1_WIDTH             (1U)
#define GDU_AE_OFFSDCFG_OSDPD1(x)                (((uint8_t)(((uint8_t)(x)) << GDU_AE_OFFSDCFG_OSDPD1_SHIFT)) & GDU_AE_OFFSDCFG_OSDPD1_MASK)

